** Application Key Rotation

By default, the CDK package has some hard coded keys. This is fine for
local testing, but if you run on Sepolia, you're likely to get your
funds stolen even if it's inadvertent!

First, let's create a new mnemonic seed phrase to derive our application keys.

#+begin_src bash :exports both verbatim :results output example
cast wallet new-mnemonic
#+end_src

#+RESULTS:
#+begin_example
Successfully generated a new mnemonic.
Phrase:
film crazy inform bind stomach weather cruel hold quarter stage country purpose

Accounts:
- Account 0:
Address:     0x5996602860Da5b232429A007Ffc29Fe334993143
Private key: 0x2a109c981f2fd6614f6cfbd40461cc9605904e5d4139f106a0f8759aa194b94e
#+end_example

Great! Now we have a new seed phrase to use. Now, we'll take that seed
phrase and derive application keys.

#+begin_src bash :exports both verbatim :results output example
seed="film crazy inform bind stomach weather cruel hold quarter stage country purpose"
polycli wallet inspect --mnemonic "$seed" --addresses 9 | \
    jq -r '.Addresses[] | [.ETHAddress, .HexPrivateKey] | @tsv' | \
    awk 'BEGIN{split("sequencer,aggregator,claimtxmanager,timelock,admin,loadtest,agglayer,dac,proofsigner",roles,",")} {print "l2_" roles[NR] "_address: \"" $1 "\""; print "l2_" roles[NR] "_private_key: \"0x" $2 "\"\n"}'
#+end_src

#+RESULTS:
#+begin_example
l2_sequencer_address: "0x5996602860Da5b232429A007Ffc29Fe334993143"
l2_sequencer_private_key: "0x2a109c981f2fd6614f6cfbd40461cc9605904e5d4139f106a0f8759aa194b94e"

l2_aggregator_address: "0x25697f040f8EE9145452b115F36aEd35a12d32AD"
l2_aggregator_private_key: "0xedab8a45bea025ec96808a63368ad2c8099b85944965c26256f987ff9ad712f4"

l2_claimtxmanager_address: "0xc8273E02E94598F39e8Ec8867902D4807917A165"
l2_claimtxmanager_private_key: "0x216a4646ea3dd753f799b7eb7d7f8fe57b96c01c1fcd5eec496d888f5a7677cd"

l2_timelock_address: "0x187aA720B98E064cCaCd1533be1B664D7F93F032"
l2_timelock_private_key: "0xa0e35402da2dcebb8a33b89806d043bb5785a6a04aa5d9cf47f0950d88668c65"

l2_admin_address: "0x87Ae0E9416ca1497c4AdDE7E1057D4E29f1714Cf"
l2_admin_private_key: "0x69659a88bd0950e4914f69aaa867e258ff39bc6274d1576a23c477c65987e31f"

l2_agglayer_address: "0x61773f7fca22cF7fb960DEDC6aEd0FE795018837"
l2_agglayer_private_key: "0xf44263cc5699fe3889f892834885111164eb1bea1c9f16322c5577165c578ae4"

l2_dac_address: "0x9150404Cc4d66673b1598dA00a9AC6ce1df53582"
l2_dac_private_key: "0xc1345e1b9680c8623df4f74d4b4f7bc8d9a5bebfebde34786e2146d30b1c68c0"
#+end_example

We're going to take these generated values and place them into the
[[../.github/tests/external-l1/deploy-cdk-to-sepolia.yml]] file. Each one of these settings should already exist
and you're simply replacing the keys that are already in this file.

** L1 Configuration

Now we need to adjust the parameters for L1 specifically for
Sepolia. First, let's create a new mnemonic specifically for running
contract deployment.

#+begin_src bash :exports both verbatim :results output example
cast wallet new-mnemonic
#+end_src

#+RESULTS:
#+begin_example
Phrase:
wash shoe curve captain invest aunt farm quality bomb aunt sunny arm

Accounts:
- Account 0:
Address:     0xd1c71c8ca3e031aEABB685ACDDA98e4Ca3A96fCC
Private key: 0xfbbcf7c3d0240ce02a9e3bde93f2c060db716acdf81d1d5bd4dd0a8b7f96ac63
#+end_example


We'll take that mnemonic and configure ~l1_preallocated_mnemonic~ with
this value.

#+begin_src bash
mnemonic="wash shoe curve captain invest aunt farm quality bomb aunt sunny arm"
yq -Y --in-place --arg m "$mnemonic" '.args.l1_preallocated_mnemonic = $m' .github/tests/external-l1/deploy-cdk-to-sepolia.yml
#+end_src

This account is used for two things. It sends funds to the accounts
that need funds on L1 (e.g. sequencer, aggregator, admin).  This
account also does the contract deployment. Accordingly, *we'll need to
send funds to this account*.

We have already configured the L1 chain identifier to match Sepolia's chain
identifier in the configuration file: ~l1_chain_id: 11155111~ and the
amount of funds allocated to this deployment: ~l1_funding_amount: 5ether~.

There are a few other values we need to configure for L1.

#+begin_src bash
# The L1 HTTP RPC and WS urls need to change to be valid Sepolia endpoints.
yq -Y --in-place '.args.l1_rpc_url = "https://YOUR-SEPOLIA-RPC"' .github/tests/external-l1/deploy-cdk-to-sepolia.yml
yq -Y --in-place '.args.l1_ws_url = "wss://YOUR-SEPOLIA-RPC"' .github/tests/external-l1/deploy-cdk-to-sepolia.yml

# We need to alter the finality time for erigon otherwise we'll need to wait for the contract deployment to finalize.
sed -i 's/zkevm.l1-highest-block-type: finalized/zkevm.l1-highest-block-type: latest/' templates/cdk-erigon/config.yml
#+end_src

